import { useState, useEffect } from 'react';

export default function DynamicContent() {
    const [data, setData] = useState(null);

    useEffect(() => {
        // 模拟异步数据加载
        setTimeout(() => {
            setData('这是通过流式渲染加载的动态内容这是通过流式渲染加载的动态内容这是通过流式渲染加载的动态内容这是通过流式渲染加载的动态内容这是通过流式渲染加载的动态内容这是通过流式渲染加载的动态内容这是通过流式渲染加载的动态内容这是通过流式渲染加载的动态内容这是通过流式渲染加载的动态内容这是通过流式渲染加载的动态内容这是通过流式渲染加载的动态内容这是通过流式渲染加载的动态内容这是通过流式渲染加载的动态内容这是通过流式渲染加载的动态内容这是通过流式渲染加载的动态内容这是通过流式渲染加载的动态内容这是通过流式渲染加载的动态内容');
        }, 2000);
    }, []);

    return (
        <div>
            <h2>动态内容加载完成!</h2>
            <p>{data}</p>
        </div>
    );
}
